### 실습7

### 구매액을 아이디별로 그룹화, 구매액이 높은 순으로 정렬

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT userID, SUM(price*amount) AS '총구매액' FROM buytbl
GROUP BY userID
ORDER BY SUM(price*amount) DESC;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0     1
0  BBK  3960
1  KBS  2420
2  JYP   400
3  EJW   190
4  SSK   150

### 사용자 이름은 조인해서 출력

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT B.userID, U.name, SUM(price*amount) AS '총구매액'
FROM buytbl B
RIGHT OUTER JOIN usertbl U
ON B.userID=U.userID
GROUP BY B.userID,U.name
ORDER BY SUM(price*amount) DESC; '''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1     2
0  BBK  바비킴  3960
1  KBS  김범수  2420
2  JYP  조용필   400
3  EJW  은지원   190
4  SSK  성시경   150

### 구매하지 않은 명단도 출력

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT U.userID, U.name, SUM(price*amount) AS '총구매액'
FROM buytbl B
RIGHT OUTER JOIN usertbl U
ON B.userID=U.userID
GROUP BY U.userID,U.name
ORDER BY SUM(price*amount) DESC; '''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1     2
0  BBK  바비킴  3960
1  KBS  김범수  2420
2  JYP  조용필   400
3  EJW  은지원   190
4  SSK  성시경   150

### CASE구문 SELECT에 추가

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT U.userID, U.name, SUM(price*amount) AS '총구매액',
CASE
WHEN (SUM(price*amount)>=1500) THEN '최우수고객'
WHEN (SUM(price*amount)>=1000) THEN '우수고객'
WHEN (SUM(price*amount)>=1) THEN '일반고객'
ELSE '유령고객'
END AS '고객등급'
FROM buytbl B
RIGHT OUTER JOIN usertbl U
ON B.userID=U.userID
GROUP BY U.userID,U.name
ORDER BY SUM(price*amount) DESC; '''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1     2      3
0  BBK  바비킴  3960  최우수고객
1  KBS  김범수  2420  최우수고객
2  JYP  조용필   400   일반고객
3  EJW  은지원   190   일반고객
4  SSK  성시경   150   일반고객